In [1]:
import pandas as pd

In [3]:
titanic_df = pd.read_csv(r'titanic_train.csv')
print('titanic 변수 type:', type(titanic_df))
titanic_df.head(3)

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [4]:
print('DataFrame 크기: ', titanic_df.shape)

DataFrame 크기:  (891, 12)

In [5]:
# null 데이터 개수, 데이터 분포도 등 메타 데이터 조회기능
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
# 데이터 분포도를 아는 것은 성능을 좌지우지 한다. 
 # describe()는 숫자형 데이터의 분포도, 평균값, 최댓값, 최솟값을 나타낸다.
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
# value_counts()는 데이터의 분포도를 확인하는 데 매우 유용한 함수이다.
  # DataFrame의 [] 연산자 내부에 칼럼명을 입력하면 Series 형태로 특정 칼럼 데이터 세트가 반환된다. 여기서 value_counts() 메서드를 호출해 해당 칼럼값의 유형과 건수를 확인할 수 있다.
value_counts = titanic_df['Pclass'].value_counts()
# titanic_df['Pclass'].value_counts() 이걸 통해서 칼럼 1개로 데이터를 뽑아냄. Series
print(value_counts)

titanic_pclass = titanic_df['Pclass']
print(type(titanic_pclass))

3    491
1    216
2    184
Name: Pclass, dtype: int64
<class 'pandas.core.series.Series'>

In [13]:
titanic_pclass.head()

# 모든 Series와 DataFrame은 인덱스를 반드시 가진다는 걸 보여준다.

#0    3
#1    1
#2    3
#3    1
#4    3
#Name: Pclass, dtype: int64

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [14]:
value_counts = titanic_df['Pclass'].value_counts()
print(type(value_counts))
print(value_counts)

# 인덱스는 고유성이 보장된다면 꼭 0부터 시작하지 않아도 되고, 문자열로 수정도 가능하다.
  # value_counts()는 칼럼 값별 데이터 건수를 반환하므로 고유 칼럼 값을 식별자로 사용할 수 있다.
#<class 'pandas.core.series.Series'>
#3    491
#1    216
#2    184
#Name: Pclass, dtype: int64

<class 'pandas.core.series.Series'>
3    491
1    216
2    184
Name: Pclass, dtype: int64